In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [14]:
# The code was removed by Watson Studio for sharing.

,UNITID,EFALEVEL,LINE,SECTION,LSTUDY,XEFTOTLT,EFTOTLT,XEFTOTLM,EFTOTLM,XEFTOTLW,...,XEFUNKNM,EFUNKNM,XEFUNKNW,EFUNKNW,XEFNRALT,EFNRALT,XEFNRALM,EFNRALM,XEFNRALW,EFNRALW
0,100654,1,29,3,4,R,6001,R,2429,R,...,R,65,R,124,R,72,R,38,R,34
1,100654,2,99,3,1,R,5038,R,2134,R,...,R,62,R,115,R,45,R,23,R,22
2,100654,3,99,3,1,R,4824,R,2038,R,...,R,54,R,106,R,43,R,22,R,21
3,100654,4,99,3,1,R,1294,R,518,R,...,R,22,R,46,R,9,R,3,R,6
4,100654,5,99,3,1,R,3530,R,1520,R,...,R,32,R,60,R,34,R,19,R,15

In [15]:
df.shape

(127757, 65)

In [16]:
# Upload third dataset
body = client_e0b0de43d3ed41a0a4d24ada8415e71d.get_object(Bucket='education-donotdelete-pr-lmdk4yjz3pwv2v',Key='ef2017c.csv')['Body']
# add missing __iter__ method, so pandas accepts body as file-like object
if not hasattr(body, "__iter__"): body.__iter__ = types.MethodType( __iter__, body )

df1 = pd.read_csv(body)
df1.head()

   UNITID  EFCSTATE  LINE XEFRES01  EFRES01 XEFRES02  EFRES02
0  100654         1     1        R      667        R     524.0
1  100654         5     5        R        7        R       6.0
2  100654         6     6        R       22        R      16.0
3  100654         8     8        R        4        R       3.0
4  100654        10    10        R        1        R       0.0

In [17]:
df1.shape

(39500, 7)

In [18]:
df1 = df1.drop(['LINE', 'XEFRES01', 'EFRES01', 'XEFRES02'], axis=1)
df1.head()

   UNITID  EFCSTATE  EFRES02
0  100654         1     524.0
1  100654         5       6.0
2  100654         6      16.0
3  100654         8       3.0
4  100654        10       0.0

In [19]:

body = client_e0b0de43d3ed41a0a4d24ada8415e71d.get_object(Bucket='education-donotdelete-pr-lmdk4yjz3pwv2v',Key='state_mapping.csv')['Body']
# add missing __iter__ method, so pandas accepts body as file-like object
if not hasattr(body, "__iter__"): body.__iter__ = types.MethodType( __iter__, body )

state_df = pd.read_csv(body)
state_df.rename
state_df.head()

   code       value
0     1     Alabama
1     2      Alaska
2     4     Arizona
3     5    Arkansas
4     6  California

In [20]:
# Merge df3 with state_df
new_df1 = df1.merge(state_df, left_on='EFCSTATE', right_on='code', how='left')
new_df1.head()

   UNITID  EFCSTATE  EFRES02   code       value
0  100654         1     524.0   1.0     Alabama
1  100654         5       6.0   5.0    Arkansas
2  100654         6      16.0   6.0  California
3  100654         8       3.0   8.0    Colorado
4  100654        10       0.0  10.0    Delaware

In [21]:
new_df1.shape

(39500, 5)

In [23]:
# Merge df1 and df2
df_merge = df.merge(new_df1, on='UNITID')
df_merge.head()

,UNITID,EFALEVEL,LINE,SECTION,LSTUDY,XEFTOTLT,EFTOTLT,XEFTOTLM,EFTOTLM,XEFTOTLW,...,XEFNRALT,EFNRALT,XEFNRALM,EFNRALM,XEFNRALW,EFNRALW,EFCSTATE,EFRES02,code,value
0,100654,1,29,3,4,R,6001,R,2429,R,...,R,72,R,38,R,34,1,524.0,1.0,Alabama
1,100654,1,29,3,4,R,6001,R,2429,R,...,R,72,R,38,R,34,5,6.0,5.0,Arkansas
2,100654,1,29,3,4,R,6001,R,2429,R,...,R,72,R,38,R,34,6,16.0,6.0,California
3,100654,1,29,3,4,R,6001,R,2429,R,...,R,72,R,38,R,34,8,3.0,8.0,Colorado
4,100654,1,29,3,4,R,6001,R,2429,R,...,R,72,R,38,R,34,10,0.0,10.0,Delaware

In [24]:
df_merge.tail()

,UNITID,EFALEVEL,LINE,SECTION,LSTUDY,XEFTOTLT,EFTOTLT,XEFTOTLM,EFTOTLM,XEFTOTLW,...,XEFNRALT,EFNRALT,XEFNRALM,EFNRALM,XEFNRALW,EFNRALW,EFCSTATE,EFRES02,code,value
976087,491181,59,16,2,1,R,33,R,6,R,...,Z,0,Z,0,Z,0,99,0.0,NaN,NaN
976088,491181,60,17,2,1,R,8,R,2,R,...,Z,0,Z,0,Z,0,21,0.0,21.0,Kentucky
976089,491181,60,17,2,1,R,8,R,2,R,...,Z,0,Z,0,Z,0,54,0.0,54.0,West Virginia
976090,491181,60,17,2,1,R,8,R,2,R,...,Z,0,Z,0,Z,0,58,0.0,NaN,NaN
976091,491181,60,17,2,1,R,8,R,2,R,...,Z,0,Z,0,Z,0,99,0.0,NaN,NaN

In [25]:
# should have 86 features
df_merge.shape

(976092, 69)